tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI for the Linode API
brew "linode-cli"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# CLI tool for termius.com (aka serverauditor.com)
brew "termius"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Tool for managing your YubiKey configuration
brew "ykman"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Utility to clean up corrupted installations of Adobe software
cask "adobe-creative-cloud-cleaner-tool"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Eclipse integrated development environment
cask "eclipse-ide"
# Control your Elgato Key Lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Tool to measure the computer system's performance
cask "geekbench"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Grammarly for desktop
cask "grammarly-desktop"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Interface for reading and syncing eBooks
cask "kindle"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# All-in-one live streaming software
cask "streamlabs-obs"
# Text editor for code, markup and prose
cask "sublime-text"
# SSH client
cask "termius"
# Web browser focusing on security
cask "tor-browser"
# File transfer application
cask "transmit"
# Email client with collaborative notes
cask "twobird"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Desktop client for WhatsApp
cask "whatsapp"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdBlock Pro", id: 1018301773
mas "Brother iPrint&Scan", id: 1193539993
mas "Compressor", id: 424390742
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Final Cut Pro", id: 424389933
mas "Flighty", id: 1358823008
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Lens Studio", id: 1391221278
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "NordVPN", id: 905953485
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Playgrounds", id: 1496833156
mas "Pocket", id: 568494494
mas "Save to Pocket", id: 1477385213
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Webull Desktop", id: 1334590352
mas "Xcode", id: 497799835
